CanBeDeleted Property
 Determine if this ElementType can be deleted
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2015
 Syntax
  C#
public bool CanBeDeleted { get; }
  Visual Basic
Public ReadOnly Property CanBeDeleted As Boolean
	Get
  Visual C++
public:
property bool CanBeDeleted {
	bool get ();
}
 See Also
  ElementType Class
  Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →